Revit 2027 API
TriangleInShellComponent Constructor
 Creates a copy of the given TriangleInShellComponent
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TriangleInShellComponent(
	TriangleInShellComponent other
)
Public Sub New (
	other As TriangleInShellComponent
)
public:
TriangleInShellComponent(
	TriangleInShellComponent^ other
)
new :
        other : TriangleInShellComponent -> TriangleInShellComponent
Parameters
other TriangleInShellComponent
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace